app/controllers/cryptos_controller.rb

SELECT "cryptos".* FROM "cryptos"
---
	def index
		@cryptos = Crypto.all

SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
    	@crypto = Crypto.find(params[:id])

SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@crypto = Crypto.find(params[:id])

INSERT INTO "cryptos" ("name", "short_name", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "bitcoin"], ["short_name", "btc"], ["date_of_birth", "2007-01-01"], ["created_at", "2018-02-04 19:04:39.759903"], ["updated_at", "2018-02-04 19:04:39.759903"]]
---
	def create
		@crypto = Crypto.new(crypto_params)

		if @crypto.save

SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cryptos" SET "name" = ?, "updated_at" = ? WHERE "cryptos"."id" = ?  [["name", "bitcoinCash"], ["updated_at", "2018-02-04 20:43:35.587379"], ["id", 1]]
---
	def update
		@crypto = Crypto.find(params[:id])

		if @crypto.update(crypto_params)

SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cryptos" WHERE "cryptos"."id" = ?  [["id", 1]]
---
	def destroy
		@crypto = Crypto.find(params[:id])
		@crypto.destroy